Can't solve Rebar Shape in Path Reinforcement.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
 Syntax
  C#
public static FailureDefinitionId PathShapeFailure { get; }
  Visual Basic
Public Shared ReadOnly Property PathShapeFailure As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ PathShapeFailure {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures RebarFailures Class
  Autodesk.Revit.DB Namespace